# PANDDAS

## Pandas Series

In [1]:
import pandas as pd

In [3]:
pd.Series([10,24,32,41,54])

0    10
1    24
2    32
3    41
4    54
dtype: int64

In [219]:
seri = pd.Series([10,24,32,41,54])

type(seri)

pandas.core.series.Series

In [6]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [7]:
seri.dtype

dtype('int64')

In [9]:
seri.size

5

In [10]:
seri.ndim

1

In [11]:
seri.values

array([10, 24, 32, 41, 54])

In [12]:
seri.head(3)

0    10
1    24
2    32
dtype: int64

In [13]:
seri.tail(2)

3    41
4    54
dtype: int64

In [16]:
# index isimlendirme

pd.Series([99,22,312,646,72])

0     99
1     22
2    312
3    646
4     72
dtype: int64

In [17]:
pd.Series([99,22,312,646,72], index = [1,3,5,7,9])

1     99
3     22
5    312
7    646
9     72
dtype: int64

In [20]:
pd.Series([99,22,312,646,72], index = ["a","b","c","d","e"])

a     99
b     22
c    312
d    646
e     72
dtype: int64

In [220]:
seri = pd.Series([99,22,312,646,72], index = ["a","b","c","d","e"])

seri["a"]

99

In [22]:
seri["a":"c"]

a     99
b     22
c    312
dtype: int64

In [232]:
# Dictinary üzerinnden seri oluşturma

sozluk = {"reg":10, "log":11, "cart":12}

seri = pd.Series(sozluk)
seri

reg     10
log     11
cart    12
dtype: int64

In [233]:
# İki seriyi birleştirerek seri oluşturma

pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

## Eleman İşlemleri

In [225]:
import numpy as np

In [226]:
a = np.array([1,2,33,444,75])
seri = pd.Series(a)

seri

0      1
1      2
2     33
3    444
4     75
dtype: int64

In [227]:
seri[0]

1

In [228]:
seri[1:4]

1      2
2     33
3    444
dtype: int64

In [234]:
seri = pd.Series([121,200,150,99], 
                 index = ["reg","loj","cart","rf"])

seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [33]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [34]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [35]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [36]:
seri.values

array([121, 200, 150,  99])

In [229]:
# Eleman sorgulama

"reg" in seri

False

In [39]:
"a" in seri

False

In [40]:
seri["reg"]

121

In [41]:
# Fancy eleman

seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [42]:
seri["reg"] = 130
seri["reg"]

130

In [44]:
seri["reg":"loj"]

reg    130
loj    200
dtype: int64

## Pandas DataFrame

In [47]:
l = [1,2,39,67,90]

In [48]:
pd.DataFrame(l, columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [235]:
m = np.arange(1,10).reshape((3,3))

m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [50]:
pd.DataFrame(m, columns= ["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [237]:
# df isimmlendirme

df = pd.DataFrame(m, columns= ["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [238]:
df.columns = ("deg1","deg2","deg3")

df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [54]:
type(df)

pandas.core.frame.DataFrame

In [55]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [56]:
df.shape

(3, 3)

In [57]:
df.ndim

2

In [58]:
df.size

9

In [59]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [60]:
type(df.values)

numpy.ndarray

In [62]:
df.tail(2)

   deg1  deg2  deg3
1     4     5     6
2     7     8     9

In [239]:
a = np.array([1,2,3,4,5])

pd.DataFrame(a, columns = ["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

## DataFrame eleman işlemleri

In [240]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

sozluk = {"var1":s1,"var2":s2,"var3":s3}

sozluk

{'var1': array([7, 9, 5, 4, 5]),
 'var2': array([9, 4, 0, 5, 0]),
 'var3': array([7, 2, 6, 8, 9])}

In [241]:
df = pd.DataFrame(sozluk)

df

   var1  var2  var3
0     7     9     7
1     9     4     2
2     5     0     6
3     4     5     8
4     5     0     9

In [72]:
df[0:1]

   var1  var2  var3
0     3     7     0

In [73]:
df[0:2]

   var1  var2  var3
0     3     7     0
1     9     8     2

In [74]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [75]:
df.index = ["a","b","c","d","e"]

df

In [77]:
df["c":"e"]

   var1  var2  var3
c     9     0     5
d     4     2     3
e     5     7     0

In [78]:
# silme

df.drop("a", axis=0)

   var1  var2  var3
b     9     8     2
c     9     0     5
d     4     2     3
e     5     7     0

In [79]:
df

   var1  var2  var3
a     3     7     0
b     9     8     2
c     9     0     5
d     4     2     3
e     5     7     0

In [80]:
df.drop("a", axis=0,inplace= True)

df

In [83]:
#fancy ile silme

l = ["c","e"]

In [84]:
df.drop(l,axis=0)

   var1  var2  var3
b     9     8     2
d     4     2     3

In [85]:
# degiskenler

In [86]:
"var1" in df

True

In [87]:
l = ["var1","var4","var2"]
for i in l:
    print(i in df)

True
False
True

In [88]:
df

   var1  var2  var3
b     9     8     2
c     9     0     5
d     4     2     3
e     5     7     0

In [89]:
df["var1"]

b    9
c    9
d    4
e    5
Name: var1, dtype: int64

In [90]:
df["var4"] = df["var1"]/df["var2"]

In [91]:
df

   var1  var2  var3      var4
b     9     8     2  1.125000
c     9     0     5       inf
d     4     2     3  2.000000
e     5     7     0  0.714286

In [92]:
#degisken silme

In [93]:
df.drop("var4",axis=1)

   var1  var2  var3
b     9     8     2
c     9     0     5
d     4     2     3
e     5     7     0

In [94]:
df

   var1  var2  var3      var4
b     9     8     2  1.125000
c     9     0     5       inf
d     4     2     3  2.000000
e     5     7     0  0.714286

In [95]:
df.drop("var4",axis=1,inplace=True)

In [96]:
df

   var1  var2  var3
b     9     8     2
c     9     0     5
d     4     2     3
e     5     7     0

In [97]:
#fafncy ile silme

In [98]:
l = ["var1","var2"]

In [99]:
df.drop(l,axis=1)

   var3
b     2
c     5
d     3
e     0

## Gözlem ve Değişken Seçimi : Loc and iloc

In [118]:
m = np.random.randint(1,30, size =(10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    13    24     3
1     4    13    10
2    12    13    24
3     8     7     5
4    14    25     2
5    11    19    19
6     8     4    11
7    20    27     4
8    24    17    24
9     9     5    13

In [119]:
# loc : tanımlandığı şekli ile seçim yapmak için kullanılır

In [120]:
df.loc[0:3]

   var1  var2  var3
0    13    24     3
1     4    13    10
2    12    13    24
3     8     7     5

In [121]:
# iloc : alışık olduğumuz indeksleme mantığı ile seçim yapar

In [122]:
df.iloc[0:3]

   var1  var2  var3
0    13    24     3
1     4    13    10
2    12    13    24

In [123]:
df.iloc[0,0]

13

In [124]:
df.iloc[:3,:2]

   var1  var2
0    13    24
1     4    13
2    12    13

In [125]:
df.loc[0:3,"var3"]

0     3
1    10
2    24
3     5
Name: var3, dtype: int64

In [126]:
df.iloc[0:3,2:3]

   var3
0     3
1    10
2    24

In [127]:
df.iloc[0:3]["var3"]

0     3
1    10
2    24
Name: var3, dtype: int64

## Koşullu Eleman İşlemleri

In [133]:
m = np.random.randint(1,30, size =(10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    22    29     2
1     2    20    17
2    15    20    28
3    28    10    26
4     5    18     5
5    15     5     8
6    16     2    20
7    11     6    28
8     1    23    29
9     3     8    15

In [134]:
df["var1"][0:4]

0    22
1     2
2    15
3    28
Name: var1, dtype: int64

In [135]:
df[0:2][["var1","var2"]]

   var1  var2
0    22    29
1     2    20

In [136]:
df.var1

0    22
1     2
2    15
3    28
4     5
5    15
6    16
7    11
8     1
9     3
Name: var1, dtype: int64

In [138]:
df[df.var1 > 15]

   var1  var2  var3
0    22    29     2
3    28    10    26
6    16     2    20

In [139]:
df[(df.var1 > 15) & (df.var3 < 3) ]

   var1  var2  var3
0    22    29     2

In [140]:
df.loc[(df.var1  > 15), ["var1","var2"]]

   var1  var2
0    22    29
3    28    10
6    16     2

## Birleştirme (Join) İşlemleri

In [142]:
m = np.random.randint(1,30, size =(5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0     4    14    12
1     7    19     1
2    16    26    27
3     4     4     9
4     9    27    18

In [143]:
df2 = df1+99

In [144]:
df2

   var1  var2  var3
0   103   113   111
1   106   118   100
2   115   125   126
3   103   103   108
4   108   126   117

In [145]:
pd.concat([df1,df2])

   var1  var2  var3
0     4    14    12
1     7    19     1
2    16    26    27
3     4     4     9
4     9    27    18
0   103   113   111
1   106   118   100
2   115   125   126
3   103   103   108
4   108   126   117

In [146]:
pd.concat([df1,df2], ignore_index = True)

   var1  var2  var3
0     4    14    12
1     7    19     1
2    16    26    27
3     4     4     9
4     9    27    18
5   103   113   111
6   106   118   100
7   115   125   126
8   103   103   108
9   108   126   117

In [147]:
df2.columns = ["var1","var2","deg3"]

In [148]:
pd.concat([df1,df2])

   var1  var2  var3   deg3
0     4    14  12.0    NaN
1     7    19   1.0    NaN
2    16    26  27.0    NaN
3     4     4   9.0    NaN
4     9    27  18.0    NaN
0   103   113   NaN  111.0
1   106   118   NaN  100.0
2   115   125   NaN  126.0
3   103   103   NaN  108.0
4   108   126   NaN  117.0

In [150]:
pd.concat([df1,df2], join = "inner")

   var1  var2
0     4    14
1     7    19
2    16    26
3     4     4
4     9    27
0   103   113
1   106   118
2   115   125
3   103   103
4   108   126

## İleri Birleştirme İşlemleri

In [ ]:
# Birebir birleştirme işlemi

In [153]:
df1 = pd.DataFrame({"calisanlar": ["Ali","Veli","Ayse","Fatma"],
      "grup": ["Muhasebe","Muhendislik","Muhendislik","İK"]})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [155]:
df2 = pd.DataFrame({"calisanlar": ["Ayse","Ali","Veli","Fatma"],
      "ilk_giris": [2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [156]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [157]:
pd.merge(df1,df2, on = "calisanlar")

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [158]:
# çoktan teke birleştirme

In [160]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [161]:
df4 = pd.DataFrame({"grup": ["Muhasebe","Muhendislik","İK"],
                   "mudur": ["Caner","Mustafa","Berkcan"]})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [162]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

In [163]:
## Çoktan Çoka Birleştirme

In [166]:
df5 = pd.DataFrame({"grup":["Muhasebe","Muhasebe","Muhendislik","Muhendislik","İK","İK"],
                   "yetenekler": ["matematik","excel","kodlama","linux","excel","yonetim"]})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [167]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim

## Toplulaştırma ve Gruplama (Aggregation & Groupinng)

* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [168]:
import seaborn as sns

In [170]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [171]:
df.shape

(1035, 6)

In [172]:
df.mean()

/var/folders/4b/qn8w6zs57q10jhr2bqqzljnw0000gn/T/ipykernel_22333/3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [173]:
df["mass"].mean()

2.6381605847953216

In [174]:
df["mass"].count()

513

In [176]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [178]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Gruplama İşlemleri (Grouping)

In [180]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                  "veri": [10,11,52,23,43,55]}, columns=["gruplar","veri"])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [181]:
df.groupby("gruplar")

In [182]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [183]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [184]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [186]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

## İleri Toplulaştırma İşlemleri (Aggregate,filter,transform,apply)

## Aggregate

In [188]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                  "degisken1": [10,23,33,22,11,99],
                  "degisken2": [100,253,333,262,111,969]},
                 columns= ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [189]:
df.groupby("gruplar").aggregate(["min",np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [190]:
df.groupby("gruplar").aggregate({"degisken1": "min","degisken2":max})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

## Filter

In [191]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                  "degisken1": [10,23,33,22,11,99],
                  "degisken2": [100,253,333,262,111,969]},
                 columns= ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [192]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [193]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

## Transform

In [194]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                  "degisken1": [10,23,33,22,11,99],
                  "degisken2": [100,253,333,262,111,969]},
                 columns= ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [197]:
df_a = df.iloc[:,1:3]

In [198]:
df_a

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [201]:
df_a.transform(lambda x: (x-x.mean())/ x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

## Apply

In [204]:
df = pd.DataFrame({
                  "degisken1": [10,23,33,22,11,99],
                  "degisken2": [100,253,333,262,111,969]},
                 columns= ["degisken1","degisken2"])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [205]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [ ]:
df.apply(np.mean)

In [207]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                  "degisken1": [10,23,33,22,11,99],
                  "degisken2": [100,253,333,262,111,969]},
                 columns= ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [209]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

## Pivat Tablolar

In [210]:
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [212]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [213]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [214]:
# pivot ile pivot table

In [215]:
titanic.pivot_table("survived", index = "sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [217]:
age = pd.cut(titanic["age"],[0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [218]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663